Revit 2027 API
ParameterTypeId.IfcTypeGuid Property
 "Type IfcGUID"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId IfcTypeGuid { get; }
Public Shared ReadOnly Property IfcTypeGuid As ForgeTypeId
	Get
public:
static property ForgeTypeId^ IfcTypeGuid {
	ForgeTypeId^ get ();
}
static member IfcTypeGuid : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace